<a href="https://colab.research.google.com/github/Hugekyung/TIL/blob/master/rate_data_Labeling.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import json
import datetime

df = pd.read_json("treasury_3year.json")

In [2]:
df = df.set_index('date')

In [3]:
df

            rate
date
2005-04-29  3.76
2005-05-02  3.78
2005-05-03  3.76
2005-05-04  3.77
2005-05-06  3.77
...          ...
2020-07-17  0.81
2020-07-20  0.80
2020-07-21  0.81
2020-07-22  0.81
2020-07-23  0.79

[3780 rows x 1 columns]

In [4]:
df2 = pd.date_range(start='2005-05-01', end='2020-07-23')
df2=pd.DataFrame(df2)
df2.set_index(0, inplace=True)
df2['rate'] = df['rate']

In [5]:
df2.fillna(method='pad', inplace=True) # 전날 값으로 rate값 채우기
df2.fillna(method='backfill', inplace=True) # 5월 1일 값은 다음날인 5월 2일의 rate값으로 채우기
df2

            rate
0
2005-05-01  3.78
2005-05-02  3.78
2005-05-03  3.76
2005-05-04  3.77
2005-05-05  3.77
...          ...
2020-07-19  0.81
2020-07-20  0.80
2020-07-21  0.81
2020-07-22  0.81
2020-07-23  0.79

[5563 rows x 1 columns]

In [10]:
d = datetime.timedelta(days=28)
df2['plus_month'] = None # plus_month라는 열 생성
df2['class'] = None # class라는 열 생성
for i in range(len(df2)-28):
    if df2['rate'][i] < df2['rate'][i+28]:
        df2['plus_month'][i] = df2.index[i] + d
        df2['class'][i] = 'up'
    else:
        df2['plus_month'][i] = df2.index[i] + d
        df2['class'][i] = 'down'

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  # Remove the CWD from sys.path while we load stuff.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

In [14]:
df2.rename(columns={"rate" : "treasury_rate"}, inplace = True)

In [15]:
df2

            treasury_rate           plus_month class
0
2005-05-01           3.78  2005-05-29 00:00:00  down
2005-05-02           3.78  2005-05-30 00:00:00  down
2005-05-03           3.76  2005-05-31 00:00:00  down
2005-05-04           3.77  2005-06-01 00:00:00  down
2005-05-05           3.77  2005-06-02 00:00:00  down
...                   ...                  ...   ...
2020-07-19           0.81                 None  None
2020-07-20           0.80                 None  None
2020-07-21           0.81                 None  None
2020-07-22           0.81                 None  None
2020-07-23           0.79                 None  None

[5563 rows x 3 columns]